[
  {
    "name": "Fotosphere",
    "imageUrl": "/projects/fotosphere.png",
    "description": "Une application mobile de type réseau social pour partager des photos",
    "content": "FotoSphere est une application mobile conçue dans le cadre de mon projet de fin d'étude, en technique d'intégration multimédia. L'objectif principal de cette application est de permettre aux utilisateurs de partager, d'aimer et de commenter des photos. Il s'agissait de créer une plateforme interactive de partage d'images où les utilisateurs peuvent interagir avec du contenu visuel.",
    "author": "Moumy Ndiaye",
    "date": "2024-05-13",
    "technologies": ["React Native", "Expo", "Firebase", "SCSS"],
    "projectId": "fotosphere",
    "githubUrl": "https://github.com/NMoumy/fotosphere",
    "projectUrl": "https://github.com/NMoumy/fotosphere/releases/tag/v1.0.0"
  },
  {
    "name": "Jeu de combat",
    "imageUrl": "/projects/lvdr.png",
    "description": "Un jeu de combat en 3D inspiré de Mortal Kombat, développé en équipe.",
    "content": "Dans le cadre de mon cours sur la création de jeux en équipe, j'ai dû concevoir un jeu avec une équipe de 4 personnes. Pour notre projet, nous avons choisi de créer un jeu de style Mortal Kombat en 3D, où deux royaumes s'affrontent. Mon rôle au sein de l'équipe consistait à prendre en charge le système de combat et à concevoir toutes les interfaces du jeu.",
    "author": "Moumy Ndiaye",
    "date": "2023-05-10",
    "technologies": ["Unity", "C#"],
    "projectId": "jeu-de-combat",
    "githubUrl": "https://github.com/LaVengeanceDesRoyaumes/LaVengeanceDesRoyaumes",
    "projectUrl": "https://audrey808.itch.io/la-vengeance-des-royaumes"
  },
  {
    "name": "Application température",
    "imageUrl": "/projects/appliTemperature.png",
    "description": "Application affichant la température et l'humidité d'un capteur SHT30 en temps réel.",
    "content": "Ce projet est une application monopage React qui affiche en temps réel la température et l'humidité grâce à un capteur SHT30 connecté à un ESP32. Pour développer l'application, j'ai utilisé Firebase pour assurer le stockage des données en temps réel. De plus, j'ai programmé en C++ avec l'IDE Arduino afin de récupérer les données du SHT30 et les envoyer dans une base de données. Important : Les mises à jour de température ne sont pas affichées car la carte de développement n'est pas branchée.",
    "author": "Moumy Ndiaye",
    "date": "2023-12-05",
    "technologies": ["Arduino", "C++", "firebase", "React"],
    "projectId": "application-temperature",
    "githubUrl": "https://github.com/NMoumy/appli-temperature",
    "projectUrl": "https://appli-temperature.vercel.app/"
  },
  {
    "name": "Portfolio 2025",
    "imageUrl": "/projects/portfolio.png",
    "description": "Mon portfolio personnel, développé avec NextJs.",
    "content": "Ce projet est mon portfolio 2025, j'ai décidé de le faire en NextJs pour pouvoir avoir un site plus moderne et responsive.",
    "author": "Moumy Ndiaye",
    "date": "2025-05-26",
    "technologies": ["NextJs", "Tailwind", "Typescript"],
    "projectId": "portfolio",
    "githubUrl": "https://github.com/NMoumy/portfolio",
    "projectUrl": "https://portfolio-2025-red-phi.vercel.app/"
  }
]
